{
    "excuses": [
      "We decided to promote from within. Specifically, from within the company, not from within your imagination.",
      "Unfortunately, we're looking for someone with more experience. Like, any experience would be a start.",
      "Your resume got lost in our system. By 'lost', we mean we threw it away immediately.",
      "We've decided to restructure the position. Into a position that doesn't exist.",
      "We're looking for a better cultural fit. You know, someone who actually fits in corporate culture.",
      "The hiring manager had to step down unexpectedly. They couldn't handle reading your resume.",
      "We've decided to freeze hiring for this role. Your application gave us cold feet.",
      "Unfortunately, we need someone who can start immediately. You seem like you need immediate help instead.",
      "We're looking for someone more senior. Senior in age, experience, and basic competence.",
      "Your background is impressive, but not for this role. Maybe try a different field. Or planet.",
      "We've decided to go with an internal candidate. Anyone internal is better than you external.",
      "The position requirements have changed. We now require actual skills.",
      "We need someone with a different skill set. Preferably one that exists in reality.",
      "Your salary expectations are too high. Any salary expectation is too high for your skill level.",
      "We're looking for someone with better communication skills. Like the ability to communicate competence.",
      "Unfortunately, your references didn't check out. Mostly because they don't exist.",
      "We need someone who can hit the ground running. You'd hit the ground and stay there.",
      "Your portfolio didn't quite meet our standards. Our standards being 'functional'.",
      "We've decided to go in a different direction. Any direction away from you.",
      "The role has been filled by someone more qualified. A cardboard cutout was more qualified.",
      "We need someone with more leadership experience. Leading yourself to unemployment doesn't count.",
      "Your technical skills aren't quite what we're looking for. We're looking for skills that work.",
      "We've decided to postpone hiring for this position. Indefinitely. Because of you.",
      "Unfortunately, you don't meet our minimum requirements. The minimum being competence.",
      "We need someone who's a better fit for our team dynamic. Our team prefers functioning humans.",
      "Your interview performance didn't align with our expectations. We expected better.",
      "We're looking for someone with more passion for the role. Passion for actually doing work.",
      "The position has been eliminated. We eliminated it after seeing your application.",
      "We need someone with stronger problem-solving skills. Your biggest problem is your resume.",
      "Unfortunately, your availability doesn't match our needs. We need someone available in this reality.",
      "We've decided to promote diversity in our hiring. Diverse skill sets, which you lack.",
      "Your experience level doesn't match what we're seeking. We're seeking experience, period.",
      "We need someone who can work independently. You can't even work dependently.",
      "The role requires someone more detail-oriented. You missed the details about being qualified.",
      "We're looking for someone with better time management skills. Like showing up on time to reality.",
      "Unfortunately, your personality isn't the right fit. Personality requires having one.",
      "We need someone with more creativity. Creative resume writing doesn't count.",
      "Your professional demeanor needs improvement. Being professional requires being competent first.",
      "We're looking for someone with better analytical skills. Like the ability to analyze their own inadequacy.",
      "The position requires someone more adaptable. You can't even adapt to basic job requirements.",
      "Unfortunately, you lack the necessary certifications. Being certified as incompetent doesn't help.",
      "We need someone with stronger interpersonal skills. Starting with the skill of being a person.",
      "Your work samples didn't meet our quality standards. Our standards being 'does it work?'",
      "We're looking for someone with more industry knowledge. Knowledge that this industry exists would help.",
      "The role has evolved beyond your current capabilities. It evolved into requiring actual capabilities.",
      "Unfortunately, your enthusiasm doesn't compensate for your lack of skills. Nothing could.",
      "We need someone who can handle pressure better. The pressure of doing actual work.",
      "Your career trajectory doesn't align with our goals. Your trajectory is pointing downward.",
      "We're looking for someone with better organizational skills. Starting with organizing a competent resume.",
      "The position requires someone more results-oriented. Your only result is disappointment."
    ]
  }